; domain
(define (domain grid)
  (:requirements :strips)
  (:predicates
    ; grid cells and geometry
    (place ?x)
    (left ?x ?y)
    (below ?x ?y)

    ; shapes
    (objshape ?s)

    ; locked/open cells
    ; (locked cells can be later opened with key of matching lock shape)
    (open ?x)
    (locked ?x)
    (lock_shape ?x ?s)

    ; keys and shapes
    (key ?k)
    (at ?k ?x)
    (key_shape ?k ?s)

    ; robot
    (at_robot ?x)
    (holding ?k)
    (arm_empty)
  )

  ; move along unlocked cells
  (:action move_left
    :parameters (?curpos ?nextpos)
    :precondition (and (place ?curpos) (place ?nextpos) (left ?nextpos ?curpos) 
                       (at_robot ?curpos) (open ?nextpos))
    :effect (and (at_robot ?nextpos) (not (at_robot ?curpos))))

  (:action move_right
    :parameters (?curpos ?nextpos)
    :precondition (and (place ?curpos) (place ?nextpos) (left ?curpos ?nextpos)
                       (at_robot ?curpos) (open ?nextpos))
    :effect (and (at_robot ?nextpos) (not (at_robot ?curpos))))

  (:action move_up
    :parameters (?curpos ?nextpos)
    :precondition (and (place ?curpos) (place ?nextpos) (below ?curpos ?nextpos)
                       (at_robot ?curpos) (open ?nextpos))
    :effect (and (at_robot ?nextpos) (not (at_robot ?curpos))))

  (:action move_down
    :parameters (?curpos ?nextpos)
    :precondition (and (place ?curpos) (place ?nextpos) (below ?nextpos ?curpos)
                       (at_robot ?curpos) (open ?nextpos))
    :effect (and (at_robot ?nextpos) (not (at_robot ?curpos))))

  ; pickup/putdown keys
  (:action pickup
    :parameters (?curpos ?key)
    :precondition (and (place ?curpos) (key ?key)
                       (at_robot ?curpos) (at ?key ?curpos) (arm_empty))
    :effect (and (holding ?key) (not (at ?key ?curpos)) (not (arm_empty))))

  (:action putdown
    :parameters (?curpos ?key)
    :precondition (and (place ?curpos) (key ?key)
                       (at_robot ?curpos) (holding ?key))
    :effect (and (arm_empty) (at ?key ?curpos) (not (holding ?key))))

  ; unlock cells with right key
  (:action unlock_from_below
    :parameters (?curpos ?lockpos ?key ?shape)
    :precondition (and (place ?curpos) (place ?lockpos) (key ?key) (objshape ?shape)
                       (key_shape ?key ?shape) (lock_shape ?lockpos ?shape)
		       (at_robot ?curpos) (locked ?lockpos) (holding ?key)
                       (below ?curpos ?lockpos))
    :effect (and (open ?lockpos) (not (locked ?lockpos))))

  (:action unlock_from_above
    :parameters (?curpos ?lockpos ?key ?shape)
    :precondition (and (place ?curpos) (place ?lockpos) (key ?key) (objshape ?shape)
                       (key_shape ?key ?shape) (lock_shape ?lockpos ?shape)
		       (at_robot ?curpos) (locked ?lockpos) (holding ?key)
                       (below ?lockpos ?curpos))
    :effect (and (open ?lockpos) (not (locked ?lockpos))))

  (:action unlock_from_left
    :parameters (?curpos ?lockpos ?key ?shape)
    :precondition (and (place ?curpos) (place ?lockpos) (key ?key) (objshape ?shape)
                       (key_shape ?key ?shape) (lock_shape ?lockpos ?shape)
		       (at_robot ?curpos) (locked ?lockpos) (holding ?key)
                       (left ?curpos ?lockpos))
    :effect (and (open ?lockpos) (not (locked ?lockpos))))

  (:action unlock_from_right
    :parameters (?curpos ?lockpos ?key ?shape)
    :precondition (and (place ?curpos) (place ?lockpos) (key ?key) (objshape ?shape)
                       (key_shape ?key ?shape) (lock_shape ?lockpos ?shape)
		       (at_robot ?curpos) (locked ?lockpos) (holding ?key)
                       (left ?lockpos ?curpos))
    :effect (and (open ?lockpos) (not (locked ?lockpos))))
)

; problem
(define (problem grid_9room2_fpl_s3_seed20906_n0)
  (:domain grid)
  (:objects
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 p22 p23 p24 p25 p26 p27 p28 p29 p30 p31 p32 p33 p34 p35 p36 p37 p38 p39 p40 p41 p42 p43 p44
    shape0 shape1 shape2
    key0 key1 key2
  )
  (:init
    ; Object types
    (place p0) (place p1) (place p2) (place p3) (place p4) (place p5) (place p6) (place p7) (place p8) (place p9) (place p10) (place p11) (place p12) (place p13) (place p14) (place p15) (place p16) (place p17) (place p18) (place p19) (place p20) (place p21) (place p22) (place p23) (place p24) (place p25) (place p26) (place p27) (place p28) (place p29) (place p30) (place p31) (place p32) (place p33) (place p34) (place p35) (place p36) (place p37) (place p38) (place p39) (place p40) (place p41) (place p42) (place p43) (place p44)
    (objshape shape0) (objshape shape1) (objshape shape2)
    (key key0) (key key1) (key key2)
    ; Open/locked cells
    (open p0) (open p1) (open p3) (open p4) (open p5) (open p6) (open p7) (open p8) (open p9) (open p10) (open p12) (open p13) (open p16) (open p17) (open p19) (open p20) (open p21) (open p22) (open p23) (open p24) (open p25) (open p26) (open p28) (open p29) (open p31) (open p32) (open p33) (open p34) (open p36) (open p37) (open p38) (open p39) (open p41) (open p42) (open p43) (open p44)
    (locked p2) (locked p11) (locked p14) (locked p15) (locked p18) (locked p27) (locked p30) (locked p35) (locked p40)
    ; Left/below relations
    (left p1 p0)
    (left p2 p1)
    (left p3 p2)
    (left p4 p3)
    (left p6 p5)
    (left p8 p7)
    (left p10 p9)
    (left p11 p10)
    (left p12 p11)
    (left p13 p12)
    (left p17 p16)
    (left p18 p17)
    (left p19 p18)
    (left p20 p19)
    (left p22 p21)
    (left p24 p23)
    (left p26 p25)
    (left p27 p26)
    (left p28 p27)
    (left p29 p28)
    (left p32 p31)
    (left p34 p33)
    (left p35 p34)
    (left p36 p35)
    (left p37 p36)
    (left p39 p38)
    (left p40 p39)
    (left p41 p40)
    (left p42 p41)
    (left p44 p43)
    (below p0 p7)
    (below p1 p8)
    (below p3 p9)
    (below p4 p10)
    (below p5 p12)
    (below p6 p13)
    (below p7 p14)
    (below p13 p15)
    (below p14 p16)
    (below p15 p22)
    (below p16 p23)
    (below p17 p24)
    (below p19 p25)
    (below p20 p26)
    (below p21 p28)
    (below p22 p29)
    (below p24 p30)
    (below p30 p32)
    (below p31 p38)
    (below p32 p39)
    (below p33 p41)
    (below p34 p42)
    (below p36 p43)
    (below p37 p44)
    ; Lock and key shapes
    (lock_shape p40 shape0)
    (lock_shape p30 shape0)
    (lock_shape p27 shape1)
    (lock_shape p2 shape2)
    (lock_shape p11 shape1)
    (lock_shape p18 shape2)
    (lock_shape p14 shape0)
    (lock_shape p35 shape0)
    (lock_shape p15 shape2)
    (key_shape key0 shape0)
    (key_shape key1 shape1)
    (key_shape key2 shape2)
    ; Key placement
    (at key0 p44)
    (at key1 p3)
    (at key2 p30)
    ; Robot placement
    (at_robot p43)
    (arm_empty)
  )
  (:goal (at_robot p21))
)

; plan
1. (move_left p43 p44)
   deleted: (at_robot p43)
   added: (at_robot p44)
   goals met: 0 of 1
2. (pickup p44 key0)
   deleted: (at key0 p44) (arm_empty)
   added: (holding key0)
   goals met: 0 of 1
3. (move_right p44 p43)
   deleted: (at_robot p44)
   added: (at_robot p43)
   goals met: 0 of 1
4. (move_down p43 p36)
   deleted: (at_robot p43)
   added: (at_robot p36)
   goals met: 0 of 1
5. (unlock_from_left p36 p35 key0 shape0)
   deleted: (locked p35)
   added: (open p35)
   goals met: 0 of 1
6. (move_right p36 p35)
   deleted: (at_robot p36)
   added: (at_robot p35)
   goals met: 0 of 1
7. (move_right p35 p34)
   deleted: (at_robot p35)
   added: (at_robot p34)
   goals met: 0 of 1
8. (move_right p34 p33)
   deleted: (at_robot p34)
   added: (at_robot p33)
   goals met: 0 of 1
9. (move_up p33 p41)
   deleted: (at_robot p33)
   added: (at_robot p41)
   goals met: 0 of 1
10. (unlock_from_left p41 p40 key0 shape0)
   deleted: (locked p40)
   added: (open p40)
   goals met: 0 of 1
11. (move_right p41 p40)
   deleted: (at_robot p41)
   added: (at_robot p40)
   goals met: 0 of 1
12. (move_right p40 p39)
   deleted: (at_robot p40)
   added: (at_robot p39)
   goals met: 0 of 1
13. (move_down p39 p32)
   deleted: (at_robot p39)
   added: (at_robot p32)
   goals met: 0 of 1
14. (unlock_from_above p32 p30 key0 shape0)
   deleted: (locked p30)
   added: (open p30)
   goals met: 0 of 1
15. (move_down p32 p30)
   deleted: (at_robot p32)
   added: (at_robot p30)
   goals met: 0 of 1
16. (move_down p30 p24)
   deleted: (at_robot p30)
   added: (at_robot p24)
   goals met: 0 of 1
17. (move_right p24 p23)
   deleted: (at_robot p24)
   added: (at_robot p23)
   goals met: 0 of 1
18. (move_down p23 p16)
   deleted: (at_robot p23)
   added: (at_robot p16)
   goals met: 0 of 1
19. (unlock_from_above p16 p14 key0 shape0)
   deleted: (locked p14)
   added: (open p14)
   goals met: 0 of 1
20. (move_left p16 p17)
   deleted: (at_robot p16)
   added: (at_robot p17)
   goals met: 0 of 1
21. (move_up p17 p24)
   deleted: (at_robot p17)
   added: (at_robot p24)
   goals met: 0 of 1
22. (move_up p24 p30)
   deleted: (at_robot p24)
   added: (at_robot p30)
   goals met: 0 of 1
23. (putdown p30 key0)
   deleted: (holding key0)
   added: (arm_empty) (at key0 p30)
   goals met: 0 of 1
24. (pickup p30 key2)
   deleted: (at key2 p30) (arm_empty)
   added: (holding key2)
   goals met: 0 of 1
25. (move_down p30 p24)
   deleted: (at_robot p30)
   added: (at_robot p24)
   goals met: 0 of 1
26. (move_right p24 p23)
   deleted: (at_robot p24)
   added: (at_robot p23)
   goals met: 0 of 1
27. (move_down p23 p16)
   deleted: (at_robot p23)
   added: (at_robot p16)
   goals met: 0 of 1
28. (move_down p16 p14)
   deleted: (at_robot p16)
   added: (at_robot p14)
   goals met: 0 of 1
29. (move_down p14 p7)
   deleted: (at_robot p14)
   added: (at_robot p7)
   goals met: 0 of 1
30. (move_left p7 p8)
   deleted: (at_robot p7)
   added: (at_robot p8)
   goals met: 0 of 1
31. (move_down p8 p1)
   deleted: (at_robot p8)
   added: (at_robot p1)
   goals met: 0 of 1
32. (unlock_from_right p1 p2 key2 shape2)
   deleted: (locked p2)
   added: (open p2)
   goals met: 0 of 1
33. (move_left p1 p2)
   deleted: (at_robot p1)
   added: (at_robot p2)
   goals met: 0 of 1
34. (move_left p2 p3)
   deleted: (at_robot p2)
   added: (at_robot p3)
   goals met: 0 of 1
35. (move_left p3 p4)
   deleted: (at_robot p3)
   added: (at_robot p4)
   goals met: 0 of 1
36. (move_up p4 p10)
   deleted: (at_robot p4)
   added: (at_robot p10)
   goals met: 0 of 1
37. (putdown p10 key2)
   deleted: (holding key2)
   added: (arm_empty) (at key2 p10)
   goals met: 0 of 1
38. (move_right p10 p9)
   deleted: (at_robot p10)
   added: (at_robot p9)
   goals met: 0 of 1
39. (move_down p9 p3)
   deleted: (at_robot p9)
   added: (at_robot p3)
   goals met: 0 of 1
40. (pickup p3 key1)
   deleted: (at key1 p3) (arm_empty)
   added: (holding key1)
   goals met: 0 of 1
41. (move_left p3 p4)
   deleted: (at_robot p3)
   added: (at_robot p4)
   goals met: 0 of 1
42. (move_up p4 p10)
   deleted: (at_robot p4)
   added: (at_robot p10)
   goals met: 0 of 1
43. (unlock_from_right p10 p11 key1 shape1)
   deleted: (locked p11)
   added: (open p11)
   goals met: 0 of 1
44. (putdown p10 key1)
   deleted: (holding key1)
   added: (arm_empty) (at key1 p10)
   goals met: 0 of 1
45. (pickup p10 key2)
   deleted: (at key2 p10) (arm_empty)
   added: (holding key2)
   goals met: 0 of 1
46. (move_left p10 p11)
   deleted: (at_robot p10)
   added: (at_robot p11)
   goals met: 0 of 1
47. (move_left p11 p12)
   deleted: (at_robot p11)
   added: (at_robot p12)
   goals met: 0 of 1
48. (move_left p12 p13)
   deleted: (at_robot p12)
   added: (at_robot p13)
   goals met: 0 of 1
49. (unlock_from_below p13 p15 key2 shape2)
   deleted: (locked p15)
   added: (open p15)
   goals met: 0 of 1
50. (move_up p13 p15)
   deleted: (at_robot p13)
   added: (at_robot p15)
   goals met: 0 of 1
51. (move_up p15 p22)
   deleted: (at_robot p15)
   added: (at_robot p22)
   goals met: 0 of 1
52. (move_right p22 p21)
   deleted: (at_robot p22)
   added: (at_robot p21)
   goals met: 1 of 1
